cs101/operators.tex
% Created 2022-02-08 Tue 12:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{John Doe}
\date{\today}
\title{Operators}
\hypersetup{
 pdfauthor={John Doe},
 pdftitle={Operators},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{itemize}
\item Note there is no exponent operator in vanilla java, instead use Math.pow(a, e), where a is the \textbf{base} and e is the \textbf{exponent}.
\end{itemize}
\section{Operators}
\label{sec:orgafed8e2}
\begin{center}
\begin{tabular}{ll}
Basic Operations & Atithmetic\\
\hline
* & Multiplication\\
\% & Modulo (Remainder)\\
- & Subtraction\\
+ & Addition\\
 & \\
\end{tabular}
\end{center}

\subsection{Precedence}
\label{sec:org4999be3}
\begin{verbatim}
System.out.println(3 + 6);
System.out.println(3 + 6 - 2 * 4 + 5);
System.out.println(3 / 6);
\end{verbatim}

\subsection{Division}
\label{sec:org22c5243}
In java integer division results in only whole numbers being reported. Think of it kind of like rounding down to the nearest whole number. If one of the numbers is a float java will keep the answer as a float.
\begin{verbatim}
System.out.println(9 / 6);
System.out.println(9.0 / 6.0);
System.out.println(9.0 / 6);

\end{verbatim}
\subsection{Modulo}
\label{sec:orgc18d412}
This operator will give us the remainder of a division operation. 6 goes into 9 one time with 3 leftover. When the argument on the left is smaller than the right the output is still the numerator of the mixed number. So 1 \% 4 results in 0 1/4 -> 1, or 2 \% 4 = 0 2/4 -> 2. The result from a modulo cannot exceed the argument on the right, but it can be any whole number below it. 
\begin{verbatim}
System.out.println(9 % 6);
System.out.println(10 % 4);
System.out.println(8 % 4);
System.out.println(0 % 4);
System.out.println(1 % 4);
System.out.println(3 % 4);
\end{verbatim}

\section{Increment/Decrement}
\label{sec:org0317b77}
Both the ++ and the -- operators take exactly one argunemt, \textbf{Urnary}. The \textbf{post-fix} operator is the same thing as saying (arg = arg + 1). The post fix operator will pull the value, and the increment it, thus the increment is \textbf{post} assignement. The \textbf{pre-fix} operator is like (arg = arg + 1) but the arg is incremented before assignment. 
\begin{verbatim}
int i = 10;
int j = 20;
System.out.println(i++);
System.out.println(++j);
System.out.println(i);
\end{verbatim}

\begin{verbatim}
int i = 10;
int j = 20;
i = j++;
System.out.println("i is set to j before incrementing");
System.out.println("i=" + i);
System.out.println("j=" + j);
i = ++j;
System.out.println("i is set to j after incrementing");
System.out.println("i=" + i);
System.out.println("j=" + j);
\end{verbatim}
\end{document}
